{
    "rate_limit": "Demasiados intentos. Intenta de nuevo en :seconds segundos.",
    "brute_force_detected": "Se detectó un posible ataque de fuerza bruta desde tu IP.",
    "account_locked": "Tu cuenta ha sido bloqueada temporalmente por seguridad.",
    "invalid_credentials": "Las credenciales proporcionadas no son correctas.",
    "session_expired": "Tu sesión ha expirado. Por favor, inicia sesión nuevamente.",
    "security_violation": "Se detectó una violación de seguridad.",
    "access_denied": "Acceso denegado. No tienes permisos para realizar esta acción.",
    "suspicious_activity": "Actividad sospechosa detectada. Tu sesión ha sido cerrada por seguridad.",
    "password_too_weak": "La contraseña es demasiado débil. Debe contener al menos 8 caracteres, incluyendo mayúsculas, minúsculas, números y símbolos.",
    "email_already_exists": "Este correo electrónico ya está registrado.",
    "invalid_email_format": "El formato del correo electrónico no es válido.",
    "password_mismatch": "Las contraseñas no coinciden.",
    "login_successful": "Inicio de sesión exitoso.",
    "logout_successful": "Cierre de sesión exitoso.",
    "password_changed": "Contraseña cambiada exitosamente.",
    "email_verification_sent": "Se ha enviado un enlace de verificación a tu correo electrónico.",
    "email_verified": "Tu correo electrónico ha sido verificado exitosamente.",
    "password_reset_sent": "Se ha enviado un enlace de restablecimiento de contraseña a tu correo electrónico.",
    "password_reset_successful": "Tu contraseña ha sido restablecida exitosamente.",
    "account_created": "Cuenta creada exitosamente. Por favor, verifica tu correo electrónico.",
    "too_many_requests": "Demasiadas solicitudes. Por favor, espera un momento antes de intentar nuevamente.",
    "maintenance_mode": "El sitio está en modo mantenimiento. Por favor, vuelve más tarde.",
    "csrf_token_mismatch": "Token CSRF inválido. Por favor, recarga la página e intenta nuevamente.",
    "session_timeout": "Tu sesión ha expirado por inactividad. Por favor, inicia sesión nuevamente.",
    "concurrent_session_limit": "Has alcanzado el límite de sesiones simultáneas. Se cerrará la sesión más antigua.",
    "ip_blocked": "Tu dirección IP ha sido bloqueada temporalmente por múltiples intentos fallidos.",
    "geolocation_blocked": "El acceso desde tu ubicación geográfica no está permitido.",
    "browser_not_supported": "Tu navegador no es compatible con esta aplicación.",
    "javascript_required": "JavaScript es requerido para usar esta aplicación.",
    "cookies_required": "Las cookies son requeridas para usar esta aplicación.",
    "secure_connection_required": "Se requiere una conexión segura (HTTPS) para acceder a esta página.",
    "file_upload_error": "Error al subir el archivo. Verifica el formato y tamaño.",
    "file_type_not_allowed": "Tipo de archivo no permitido.",
    "file_too_large": "El archivo es demasiado grande.",
    "malware_detected": "Se detectó posible malware en el archivo subido.",
    "invalid_file_extension": "Extensión de archivo no válida.",
    "upload_successful": "Archivo subido exitosamente.",
    "delete_confirmation": "¿Estás seguro de que deseas eliminar este elemento?",
    "operation_successful": "Operación completada exitosamente.",
    "operation_failed": "La operación falló. Por favor, intenta nuevamente.",
    "validation_error": "Error de validación. Por favor, revisa los campos marcados.",
    "server_error": "Error del servidor. Por favor, contacta al administrador.",
    "not_found": "El recurso solicitado no fue encontrado.",
    "unauthorized": "No autorizado. Debes iniciar sesión para acceder a este recurso.",
    "forbidden": "Prohibido. No tienes permisos para acceder a este recurso.",
    "method_not_allowed": "Método no permitido para este recurso.",
    "request_timeout": "La solicitud ha expirado. Por favor, intenta nuevamente.",
    "internal_server_error": "Error interno del servidor. Por favor, contacta al administrador.",
    "service_unavailable": "Servicio no disponible. Por favor, vuelve más tarde.",
    "gateway_timeout": "Tiempo de espera agotado. Por favor, intenta nuevamente.",
    "Avatar actualizado correctamente.": "Avatar actualizado correctamente.",
    "No se pudo actualizar el avatar. Inténtalo de nuevo.": "No se pudo actualizar el avatar. Inténtalo de nuevo.",
    "Avatar eliminado correctamente.": "Avatar eliminado correctamente.",
    "No había avatar para eliminar (operación idempotente).": "No había avatar para eliminar (operación idempotente).",
    "No se pudo eliminar el avatar. Inténtalo de nuevo.": "No se pudo eliminar el avatar. Inténtalo de nuevo."
}
